CSI API ETABS v1

# cFrameObjSetInsertionPoint_1 Method

---

**Namespace:** ETABSv1
**Assembly:** ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (1.27.0.0)

Syntax

C#

VB

C++

F#

Copy

    int SetInsertionPoint_1(
    	string Name,
    	int CardinalPoint,
    	bool Mirror2,
    	bool Mirror3,
    	bool StiffTransform,
    	ref double[] Offset1,
    	ref double[] Offset2,
    	string CSys = "Local",
    	eItemType ItemType = eItemType.Objects
    )

    Function SetInsertionPoint_1 (
    	Name As String,
    	CardinalPoint As Integer,
    	Mirror2 As Boolean,
    	Mirror3 As Boolean,
    	StiffTransform As Boolean,
    	ByRef Offset1 As Double(),
    	ByRef Offset2 As Double(),
    	Optional CSys As String = "Local",
    	Optional ItemType As eItemType = eItemType.Objects
    ) As Integer

    Dim instance As cFrameObj
    Dim Name As String
    Dim CardinalPoint As Integer
    Dim Mirror2 As Boolean
    Dim Mirror3 As Boolean
    Dim StiffTransform As Boolean
    Dim Offset1 As Double()
    Dim Offset2 As Double()
    Dim CSys As String
    Dim ItemType As eItemType
    Dim returnValue As Integer

    returnValue = instance.SetInsertionPoint_1(Name,
    	CardinalPoint, Mirror2, Mirror3,
    	StiffTransform, Offset1, Offset2,
    	CSys, ItemType)

    int SetInsertionPoint_1(
    	String^ Name,
    	int CardinalPoint,
    	bool Mirror2,
    	bool Mirror3,
    	bool StiffTransform,
    	array<double>^% Offset1,
    	array<double>^% Offset2,
    	String^ CSys = L"Local",
    	eItemType ItemType = eItemType::Objects
    )

    abstract SetInsertionPoint_1 :
            Name : string *
            CardinalPoint : int *
            Mirror2 : bool *
            Mirror3 : bool *
            StiffTransform : bool *
            Offset1 : float[] byref *
            Offset2 : float[] byref *
            ?CSys : string *
            ?ItemType : eItemType
    (* Defaults:
            let _CSys = defaultArg CSys "Local"
            let _ItemType = defaultArg ItemType eItemType.Objects
    *)
    -> int

#### Parameters

Name

    Type: SystemString

CardinalPoint

    Type: SystemInt32

Mirror2

    Type: SystemBoolean

Mirror3

    Type: SystemBoolean

StiffTransform

    Type: SystemBoolean

Offset1

    Type: SystemDouble

Offset2

    Type: SystemDouble

CSys (Optional)

    Type: SystemString

ItemType (Optional)

    Type: ETABSv1eItemType

#### Return Value

Type: Int32

See Also

#### Reference

cFrameObj Interface

ETABSv1 Namespace

ETABS®, SAFE®, SAP2000® and CSiBridge® are registered trademarks of Computers
and Structures, Inc.

Copyright © Computers and Structures, Inc. 2023. All rights
reserved.

support@csiamerica.com